Console.Clear();
Console.Write("Задайте размер массива: ");
int num = Convert.ToInt32(Console.ReadLine());

int[] randomArray(int a) // метод для первой и второй задачи
{
    int[] arr = new int[a];
    for (int i = 0; i < arr.Length; i++)
    {
        arr[i] = new Random().Next(100, 1000); // исходя из условия задачи можно задать нужный диапазон генерации чисел
        Console.Write($"{arr[i]} ");
    }
    return arr;
}

// Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве.
// [345, 897, 568, 234] -> 2

int[] newArr = randomArray(num);
int amount = 0;
for(int i = 0; i < newArr.Length; i++){
    if(newArr[i] % 2 == 0) amount++;
}
Console.WriteLine($"<- количество четных чисел в массие = {amount}");

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Задача 36: Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных позициях.
// [3, 7, 23, 12] -> 19
// [-4, -6, 89, 6] -> 0

// int[] newArr = randomArray(num);
// int result = 0;
// for(int i = 1; i < newArr.Length; i += 2){
//     result = newArr[i] + result;
// }
// Console.WriteLine($"<- сумма элементов массива на нечетных позициях = {result}");

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Задача 38: Задайте массив вещественных чисел. Найдите разницу между максимальным и минимальным элементов массива.
// [3 7 22 2 78] -> 76

// maxMin(randomArray(num));

// double[] randomArray(int a)
// {
//     double[] arr = new double[a];
//     for (int i = 0; i < arr.Length; i++)
//     {
//         arr[i] = Math.Round(new Random().NextDouble() * 40 - 20, 2); // можно поменять значения массива исходя из условия задачи. Не стал создавать несколько разных методов или возможность ввода диапазона для генерации массива для пользователя. Проще поменять значения в методе под нужные условия задачи.
//         Console.Write($"{arr[i]} ");
//     }
//     Console.WriteLine();
//     return arr;
// }

// void maxMin (double[] a){
//     double[] arr = a;
//     double max = arr[0];
//     double min = arr[0];
//     for (int i = 1; i < arr.Length; i++)
//     {
//         if (arr[i] > max)
//         {
//             max = arr[i];
//         }
//         else if (min > arr[i])
//         {
//             min = arr[i];
//         }
//     }
//     Console.WriteLine($"max {max} ");
//     Console.WriteLine($"min {min} ");
//     Console.WriteLine($"Разница между самым большим и самым маленьким элементом массива = {max-min} ");
// }

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////